app/Views/orders/index.php

SELECT *
FROM `paket_layanan`
---
                            <label class="form-label">Paket Layanan</label>
                            <select name="id_paket" class="form-select" required>
                                <option value="">-- Pilih Paket --</option>
                                <?php foreach ((new \App\Models\PaketLayanan())->findAll() as $p): ?>