app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function login()
    {
        if ($this->request->is('post')) {
            $rules = [
                'username' => 'required|min_length[3]|max_length[50]',
                'password' => 'required|min_length[6]',
            ];

            $messages = [
                'username' => [
                    'required' => 'Username wajib diisi.',
                    'min_length' => 'Username minimal 3 karakter.',
                    'max_length' => 'Username maksimal 50 karakter.',
                ],
                'password' => [
                    'required' => 'Password wajib diisi.',
                    'min_length' => 'Password minimal 6 karakter.',
                ],
            ];

            if ($this->validate($rules, $messages)) {
                $username = trim($this->request->getPost('username'));
                $password = $this->request->getPost('password');

                $user = $this->userModel->where('username', $username)->first();

INSERT INTO `users` (`username`, `password`, `created_at`, `updated_at`) VALUES ('zulfi', '$2y$10$qpa7oKFzQkqGy/YxatoOaeRx1hhQx.svFdCRK4MoFW7YG4a0j67aO', '2026-07-05 23:21:11', '2026-07-05 23:21:11')
---
    public function register()
    {
        if ($this->request->is('post')) {
            $data = [
                'username' => $this->request->getPost('username'),
                'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
            ];

            if ($this->userModel->insert($data)) {