app/Controllers/Home.php

    public function index()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/auth/login');
        }

        $data = [
            'total_paket'  => count($this->paketModel->findAll()),
            'total_order'  => count($this->orderModel->findAll()),
            'paket'        => $this->paketModel->limit(5)->findAll(),
            'orders'       => $this->orderModel->limit(5)->findAll(),
---
SELECT *
FROM `orders`
SELECT *
FROM `orders`
 LIMIT 5