app/Controllers/Orders.php

    public function index()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/auth/login');
        }

        $data = [
            'orders' => $this->orderModel->findAll(),
            'cartItems' => $this->cart->contents(),
            'cartTotal' => $this->cart->total(),
        ];
---
SELECT *
FROM `orders`

    public function create()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/auth/login');
        }

        if ($this->request->is('post')) {
            $harga       = $this->paketModel->find($this->request->getPost('id_paket'))['harga'] ?? 0;
            $berat       = $this->request->getPost('berat');
            $total_harga = $harga * $berat;

            $data = [
                'nama_pelanggan' => $this->request->getPost('nama_pelanggan'),
                'no_hp'          => $this->request->getPost('no_hp'),
                'id_paket'       => $this->request->getPost('id_paket'),
                'berat'          => $berat,
                'total_harga'    => $total_harga,
                'tanggal_masuk'  => $this->request->getPost('tanggal_masuk'),
                'status'         => 'Proses',
            ];

            if ($this->orderModel->insert($data)) {
---
INSERT INTO `orders` (`nama_pelanggan`, `no_hp`, `id_paket`, `berat`, `total_harga`, `tanggal_masuk`, `status`, `created_at`, `updated_at`) VALUES ('Rama Arfiansah', '085222124321', '3', '10', 150000, '2026-06-22', 'Proses', '2026-06-22 01:58:28', '2026-06-22 01:58:28')